Tekla Open API Reference for Tekla Structures 2025
ShapeCatalog Properties
The ShapeCatalog type exposes the following members.
Properties
Name | Description
ButtonText
 Gets and sets the text of the button control.
SelectedShape
 Gets or sets the selected Shape in the control.
Top
See Also
Reference
ShapeCatalog Class
Tekla.Structures.Dialog.UIControls Namespace